import os,time,platform

print('\n\x1b[1;37m[•] Checking Update...');time.sleep(0.5)

os.system('git pull')



logo = ("""\033[1;37m==============================

\033[1;37m=  ====  ==      ====        =    \033[1;32m 𓆩𝐇𝐈𝐋𝐀𝐑𝐈𝐎𝐔𝐒𓆪

\033[1;37m=  ====  ==  ===  ===  =======

\033[1;37m=  ====  ==  ====  ==  =======

\033[1;37m=  ====  ==  ===  ===  =======      \033[1;32m 𓆩𝐁𝐑𝐔𝐓𝐄𓆪

\033[1;37m=        ==      ====      ===

\033[1;37m=  ====  ==  ===  ===  =======

\033[1;37m=  ====  ==  ====  ==  =======      \033[1;32m 𓆩𝐅𝐎𝐑𝐂𝐄𓆪

\033[1;37m=  ====  ==  ===  ===  =======

\033[1;37m=  ====  ==      ====  =======

\033[1;37m==============================

\033[1;37m╔ⒽⒷⒻ═════════════════\033[1;33m𝐇𝐁𝐅✯𝐓𝐄𝐀𝐌\033[1;37m══════════════ⒽⒷⒻ╗

\033[1;31m│\033[1;32m☞  \033[1;32m𝐀𝐔𝐓𝐇𝐎𝐑     \033[1;31m➟   \033[1;32m𝐌𝐔𝐇𝐀𝐌𝐌𝐀𝐃 𝐇𝐀𝐌𝐈𝐃 𝐊𝐇𝐀𝐖𝐀𝐉𝐀     \033[1;31m│

\033[1;31m│\033[1;32m☞  \033[1;32m𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊   \033[1;31m➟   \033[1;32m𝐌𝐔𝐇𝐀𝐌𝐌𝐀𝐃 𝐇𝐀𝐌𝐈𝐃 𝐊𝐇𝐀𝐖𝐀𝐉𝐀\033[1;31m     │

\033[1;31m│\033[1;32m☞  \033[1;32m𝐆𝐈𝐓𝐇𝐔𝐁    \033[1;31m ➟   \033[1;32m𝐇𝐚𝐦𝐢𝐢-𝐤𝐢𝐧𝐠-𝟎𝟔             \033[1;31m │

\033[1;31m│\033[1;32m☞  \033[1;32m𝐖𝐇𝐀𝐓𝐒𝐀𝐏𝐏  \033[1;31m ➟   \033[1;32m+923155912839             \033[1;31m │

\033[1;31m│\033[1;32m☞  \033[1;32m𝐕𝐄𝐑𝐒𝐈𝐎𝐍   \033[1;31m ➟   \033[1;32m0.3                     \033[1;31m   │

\033[1;31m│\033[1;32m☞  \033[1;32m𝐘𝐎𝐔𝐓𝐔𝐁𝐄   \033[1;31m ➟   \033[1;32m𝐇𝐀𝐌𝐈𝐈 𝐖𝐎𝐑𝐋𝐃             \033[1;31m   │

\033[1;37m╚ⒽⒷⒻFACEBOOK TRICKS AND HELPING ZONE{ HBF }\033[1;37mⒽⒷⒻ╝

 

\033[1;91m========================================================== """)

def Run():

        bit = platform.architecture()[0]

        os.system('clear')

        print(logo)

        print('[•] WELCOME TO BOT COMMENT TOOL\n') 

        print('[1] GO TO MENU \n\n[0] Exit')

        HAMID = input('[•] Choose : ')

        if HAMID =='1':

                if bit =='32bit':

                        import AUTO_COMMENT32

                elif bit =='64bit':

                        import AUTO_COMMENT64

        elif HAMID =='2':

                if bit =='32bit':

                        import menu

                elif bit =='64bit':

                        import menu

Run()
